Revit 2024 API
ElementPhaseStatusFilter Constructor
Overload List
Name | Description
ElementPhaseStatusFilter(ElementId, ElementOnPhaseStatus)
 Constructs a new instance of a file to match elements that have a given phase status on the input phase.
ElementPhaseStatusFilter(ElementId, ICollection<ElementOnPhaseStatus>)
 Constructs a new instance of a file to match elements that have a given phase statuses on the input phase.
ElementPhaseStatusFilter(ElementId, ElementOnPhaseStatus, Boolean)
 Constructs a new instance of a file to match elements that have a given phase status on the input phase, with the option to match all elements that have a phase status other than the input status.
ElementPhaseStatusFilter(ElementId, ICollection<ElementOnPhaseStatus>, Boolean)
 Constructs a new instance of a file to match elements that have a given phase statuses on the input phase, with the option to match all elements that have a phase status other than the input statuses.
See Also
ElementPhaseStatusFilter Class
ElementPhaseStatusFilter Members
Autodesk.Revit.DB Namespace